hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/bootloader/dfu/nrf_dfu_validation.c
    return ret_val;
}


/**
    @brief Function to check if single bank update should be used.

    @param new_fw_type Firmware type.
*/
static bool use_single_bank(dfu_fw_type_t new_fw_type)
{
    bool result = false;
    
    if(((new_fw_type == DFU_FW_TYPE_APPLICATION) || (new_fw_type == DFU_FW_TYPE_SOFTDEVICE)) &&
       NRF_DFU_SINGLE_BANK_APP_UPDATES)
        result = true;
        
    return result;
}


// Function to determine whether the new firmware needs a SoftDevice to be present.
static bool update_requires_softdevice(dfu_init_command_t const *p_init)
{
    return ((p_init->sd_req_count > 0) && (p_init->sd_req[0] != SD_REQ_APP_OVERWRITES_SD));
}


// Function to determine whether the SoftDevice can be removed during the update or not.
static bool keep_softdevice(dfu_init_command_t const *p_init)
{
    UNUSED_PARAMETER(p_init); // It's unused when DFU_REQUIRES_SOFTDEVICE is true.
    return DFU_REQUIRES_SOFTDEVICE || update_requires_softdevice(p_init);
}


/** @brief Function to determine where to temporarily store the incoming firmware.
          This also checks whether the update will fit, and deletes existing
          firmware to make room for the new firmware.

    @param[in]  p_init   Init command.
    @param[in]  fw_size  The size of the incoming firmware.
    @param[out] p_addr   The address at which to initially store the firmware.

    @retval NRF_DFU_RES_CODE_SUCCESS                 If the size check passed and
                                                    an address was found.
    @retval NRF_DFU_RES_CODE_INSUFFICIENT_RESOURCES  If the size check failed.
*/
static nrf_dfu_result_t update_data_addr_get(dfu_init_command_t const *p_init,
                                             uint32_t                   fw_size,
                                             uint32_t                  *p_addr)
{
    nrf_dfu_result_t ret_val = NRF_DFU_RES_CODE_SUCCESS;
    ret_code_t err_code = nrf_dfu_cache_prepare(fw_size,
                                                use_single_bank(p_init->type),
                                                NRF_DFU_FORCE_DUAL_BANK_APP_UPDATES,
                                                keep_softdevice(p_init));
                                                
    if(err_code != NRF_SUCCESS)
    {
        NRF_LOG_ERROR("Can't find room for update");
        ret_val = NRF_DFU_RES_CODE_INSUFFICIENT_RESOURCES;
    }
    
    else
    {
        *p_addr = nrf_dfu_bank1_start_addr();
        NRF_LOG_DEBUG("Write address set to 0x%08x", *p_addr);
    }
    
    return ret_val;
}


nrf_dfu_result_t nrf_dfu_validation_init_cmd_execute(uint32_t *p_dst_data_addr,
                                                     uint32_t *p_data_len)
{
    nrf_dfu_result_t ret_val = NRF_DFU_RES_CODE_SUCCESS;
    
    if(s_dfu_settings.progress.command_offset != s_dfu_settings.progress.command_size)
    {
        // The object wasn't the right (requested) size.
        NRF_LOG_ERROR("Execute with faulty offset");
        ret_val = NRF_DFU_RES_CODE_OPERATION_NOT_PERMITTED;
    }
    
    else if(m_valid_init_cmd_present)
    {
        *p_dst_data_addr = nrf_dfu_bank1_start_addr();
        *p_data_len      = s_dfu_settings.bank_1.image_size;
        ret_val          = NRF_DFU_RES_CODE_SUCCESS;
    }
    
    else if(stored_init_cmd_decode() &&
            (m_packet.has_signed_command || m_packet.has_command))
    {
        dfu_command_t const *p_command = &m_packet.command;
        dfu_signature_type_t             signature_type = (dfu_signature_type_t) 0; // Placeholder.
        dfu_signed_command_signature_t *p_signature    = NULL;
        
        *p_dst_data_addr = 0;
        *p_data_len      = 0;
        
        if(m_packet.has_signed_command)
        {
            p_command = &m_packet.signed_command.command;
            signature_type =  m_packet.signed_command.signature_type;
            p_signature    = &m_packet.signed_command.signature;
        }
        
        // Validate signature.
        ret_val = signature_check(p_command->init.type, signature_type, p_signature);
        
        // Validate versions.
        if(ret_val == NRF_DFU_RES_CODE_SUCCESS)
        {
            ret_val = nrf_dfu_ver_validation_check(&p_command->init);
            
            if(ret_val == NRF_DFU_RES_CODE_SUCCESS)
                m_valid_init_cmd_present = true;
        }
        
        // Get size of binary.
        if(ret_val == NRF_DFU_RES_CODE_SUCCESS)
            ret_val = update_data_size_get(&p_command->init, p_data_len);
            
        //Get address where to flash the binary.
        if(ret_val == NRF_DFU_RES_CODE_SUCCESS)
            ret_val = update_data_addr_get(&p_command->init, *p_data_len, p_dst_data_addr);
    }
    
    else
    {
        NRF_LOG_ERROR("Failed to decode init packet");
        ret_val = NRF_DFU_RES_CODE_INVALID_OBJECT;
    }
    
    return ret_val;
}


// Function to check the hash received in the init command against the received firmware.
static bool fw_hash_ok(dfu_init_command_t const *p_init, uint32_t fw_start_addr, uint32_t fw_size)
{
    ret_code_t err_code;
    bool       result   = true;
    uint8_t    hash_be[NRF_CRYPTO_HASH_SIZE_SHA256];
    size_t     hash_len = NRF_CRYPTO_HASH_SIZE_SHA256;
    
    ASSERT(p_init != NULL);
    
    // Convert to hash to big-endian format for use in nrf_crypto.
    nrf_crypto_internal_swap_endian(hash_be,
                                    (uint8_t *)p_init->hash.hash.bytes,
                                    NRF_CRYPTO_HASH_SIZE_SHA256);
                                    
    NRF_LOG_DEBUG("Hash verification. Firmware start address: 0x%x, size: 0x%x",
                  fw_start_addr,
                  fw_size);
                  
    err_code = nrf_crypto_hash_calculate(&m_hash_context,
                                         &g_nrf_crypto_hash_sha256_info,
                                         (uint8_t *)fw_start_addr,
                                         fw_size,
                                         m_fw_hash,
                                         &hash_len);
                                         
    if(err_code != NRF_SUCCESS)
    {
        NRF_LOG_ERROR("Could not run hash verification (err_code 0x%x).", err_code);
        result = false;
    }
    
    else if(memcmp(m_fw_hash, hash_be, NRF_CRYPTO_HASH_SIZE_SHA256) != 0)
    {
        NRF_LOG_WARNING("Hash verification failed.");
        NRF_LOG_DEBUG("Expected FW hash:")
        NRF_LOG_HEXDUMP_DEBUG(p_init->hash.hash.bytes, NRF_CRYPTO_HASH_SIZE_SHA256);
        NRF_LOG_DEBUG("Actual FW hash:")
        NRF_LOG_HEXDUMP_DEBUG(m_fw_hash, NRF_CRYPTO_HASH_SIZE_SHA256);
        NRF_LOG_FLUSH();
        
