hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/bootloader/dfu/nrf_dfu_validation.c
        result = false;
    }
    
    return result;
}


// Function to check whether the update contains a SoftDevice and, if so, if it is of a different
// major version than the existing SoftDevice.
static bool is_major_softdevice_update(uint32_t new_sd_addr)
{
    // True if there is no SD right now, but there is a new one coming. This counts as a major update.
    bool result = !SD_PRESENT && (SD_MAGIC_NUMBER_GET(new_sd_addr) == SD_MAGIC_NUMBER);
    
    if(SD_PRESENT && (SD_MAGIC_NUMBER_GET(new_sd_addr) == SD_MAGIC_NUMBER))
    {
        // Both SoftDevices are present.
        uint32_t current_SD_major = SD_MAJOR_VERSION_EXTRACT(SD_VERSION_GET(MBR_SIZE));
        uint32_t new_SD_major     = SD_MAJOR_VERSION_EXTRACT(SD_VERSION_GET(new_sd_addr));
        
        result = (current_SD_major != new_SD_major);
        
        NRF_LOG_INFO("SoftDevice update is a %s version update. Current: %d. New: %d.",
                     result ? "major" : "minor",
                     current_SD_major,
                     new_SD_major);
    }
    
    return result;
}


/** @brief Validate the SoftDevice size and magic number in structure found at 0x2000 in received SoftDevice.

    @param[in]  sd_start_addr  Start address of received SoftDevice.
    @param[in]  sd_size        Size of received SoftDevice in bytes.
*/
static bool softdevice_info_ok(uint32_t sd_start_addr, uint32_t sd_size)
{
    bool result = true;
    
    if(SD_MAGIC_NUMBER_GET(sd_start_addr) != SD_MAGIC_NUMBER)
    {
        NRF_LOG_ERROR("The SoftDevice does not contain the magic number identifying it as a SoftDevice.");
        result = false;
    }
    
    else if(SD_SIZE_GET(sd_start_addr) < ALIGN_TO_PAGE(sd_size + MBR_SIZE))
    {
        // The size in the info struct should be rounded up to a page boundary
        // and be larger than the actual size + the size of the MBR.
        NRF_LOG_ERROR("The SoftDevice size in the info struct is too small compared with the size reported in the init command.");
        result = false;
    }
    
    return result;
}


static void postvalidate_app(dfu_init_command_t *p_init)
{
    s_dfu_settings.bank_1.bank_code = NRF_DFU_BANK_VALID_APP;
    
    NRF_LOG_DEBUG("Invalidating old application in bank 0.");
    s_dfu_settings.bank_0.bank_code = NRF_DFU_BANK_INVALID;
    
    if(!DFU_REQUIRES_SOFTDEVICE && !update_requires_softdevice(p_init))
    {
        // App does not need SD, so it should be placed where SD is.
        nrf_dfu_softdevice_invalidate();
    }
    
    if(!NRF_DFU_DEBUG ||
       (NRF_DFU_DEBUG && (p_init->has_is_debug == false || p_init->is_debug == false)))
        s_dfu_settings.app_version = p_init->fw_version;
}


// Function to check a received SoftDevice or Bootloader firmware, or both,
// before it is copied into place.
static bool postvalidate_sd_bl(dfu_init_command_t *p_init,
                               bool                 with_sd,
                               bool                 with_bl,
                               uint32_t             start_addr)
{
    if(with_sd)
    {
        if(!softdevice_info_ok(start_addr, p_init->sd_size))
            return false;
            
        if(is_major_softdevice_update(start_addr))
        {
            NRF_LOG_WARNING("Invalidating app because it is incompatible with the SoftDevice.");
            
            if(DFU_REQUIRES_SOFTDEVICE && !with_bl)
            {
                NRF_LOG_ERROR("Major SD update but no BL. Abort to avoid incapacitating the BL.");
                return false;
            }
            
            // Invalidate app since it may not be compatible with new SD.
            nrf_dfu_bank_invalidate(&s_dfu_settings.bank_0);
        }
        
        // Mark the update as valid.
        s_dfu_settings.bank_1.bank_code = with_bl ? NRF_DFU_BANK_VALID_SD_BL
                                          : NRF_DFU_BANK_VALID_SD;
                                          
        s_dfu_settings.sd_size = p_init->sd_size;
    }
    
    else
        s_dfu_settings.bank_1.bank_code = NRF_DFU_BANK_VALID_BL;
        
        
    if(with_bl &&
       (!NRF_DFU_DEBUG ||
        (NRF_DFU_DEBUG && (p_init->has_is_debug == false || p_init->is_debug == false))))
    {
        // If the update contains a bootloader, update the version.
        // Unless the update is a debug packet.
        s_dfu_settings.bootloader_version = p_init->fw_version;
    }
    
    return true;
}


nrf_dfu_result_t nrf_dfu_validation_post_data_execute(uint32_t src_addr, uint32_t data_len)
{
    nrf_dfu_result_t     ret_val = NRF_DFU_RES_CODE_SUCCESS;
    dfu_init_command_t *p_init  = m_packet.has_signed_command ?
                                  &m_packet.signed_command.command.init : &m_packet.command.init;
                                  
    if(!fw_hash_ok(p_init, src_addr, data_len))
        ret_val = EXT_ERR(NRF_DFU_EXT_ERROR_VERIFICATION_FAILED);
        
    else
    {
        if(p_init->type == DFU_FW_TYPE_APPLICATION)
            postvalidate_app(p_init);
            
        else
        {
            bool with_sd = p_init->type & DFU_FW_TYPE_SOFTDEVICE;
            bool with_bl = p_init->type & DFU_FW_TYPE_BOOTLOADER;
            
            if(!postvalidate_sd_bl(p_init, with_sd, with_bl, src_addr))
            {
                ret_val = NRF_DFU_RES_CODE_INVALID_OBJECT;
                
                if(with_sd && !DFU_REQUIRES_SOFTDEVICE &&
                   (src_addr == nrf_dfu_softdevice_start_address()))
                    nrf_dfu_softdevice_invalidate();
            }
        }
    }
    
    if(ret_val == NRF_DFU_RES_CODE_SUCCESS)
    {
        // Store CRC32 for image.
        s_dfu_settings.bank_1.image_crc = s_dfu_settings.progress.firmware_image_crc;
        s_dfu_settings.bank_1.image_size = data_len;
    }
    
    else
        nrf_dfu_bank_invalidate(&s_dfu_settings.bank_1);
        
    // Set the progress to zero and remove the last command.
    memset(&s_dfu_settings.progress, 0, sizeof(dfu_progress_t));
    memset(s_dfu_settings.init_command, 0xFF, DFU_SIGNED_COMMAND_SIZE);
    
    s_dfu_settings.write_offset                  = 0;
    s_dfu_settings.progress.update_start_address = src_addr;
    
    return ret_val;
}
